

/*
@brief Находит разность суммы квадратов и квадратов разности певых j_ натуральных чисел
@param j_ - колличество натуральных чисел
@return разность суммы квадратов и квадрата суммы
*/
long long int Problem_6(int j_);

/*
@brief Находит простое число по его номеру в ряду простых чисел
@param j_ - номер простого числа в ряду простых чисел
@return простое число
*/
long int Problem_7(int j_);

/*
@brief Находит наибольшее произведение j_ последовательных цифр в числе
@param str_ - число записанное в строку
@param len_ - длина строки с числом
@param j_ - колличество последовательно идущих цифр в числе
@return наибольшее произведение
*/
int Problem_8(char* str_,int len_, int j_);

/*
@brief Находит произведение тройки пифагора по сумме этой тройки
*/
void Problem_9(int sum_);

/*
@brief Находит сумму первых j_ простых чисел
@param j_ - колличество простых чисел
@return сумма простых чисел
*/
long long int Problem_10(int j_);